app/controllers/task_list_controller.rb

  def index

    @task_list = Task.all
---
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def show
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)

    is_successful_save = @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "trial"], ["description", "here"], ["created_at", "2018-09-23 07:16:06.387574"], ["updated_at", "2018-09-23 07:16:06.387574"], ["completion_date", "2018-10-08"]]

  def edit
    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    @task = Task.find(params[:id])

      @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "to show things"], ["completion_date", "2018-09-08"], ["updated_at", "2018-09-23 02:10:46.435296"], ["id", 10]]

  def destroy
    @task = Task.find_by(id: params[:id])

    if @task
      @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 11]]

    def complete
      @task = Task.find(params[:id].to_i)
      # @task.completed = true
      # @task.completion_date = Date.today
      @task.update(completed: true, completion_date: Date.today)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completed", true], ["completion_date", "2018-09-22"], ["updated_at", "2018-09-23 02:18:09.927233"], ["id", 8]]