app/controllers/task_list_controller.rb

  def index
    @task_list = Task.all.order(:due_date)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."due_date" ASC